Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.RightPoint Property
 The starting point of the right symbol of the section mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point RightPoint { get; }
Public ReadOnly Property RightPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
SectionMarkBase Class
Tekla.Structures.Drawing Namespace